GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/brakeAndThrottle.c
    // ***** Normal Law: modulated IQValue  *********************
    if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
    {
        brakeAndThrottle_normalLawControl();
    }   // End Normal Law
    // **************************************************************
    IQValue_array[ brakeAndThrottleIndex ] = IQValue;

    // Apply a cap to the maximum change in IQ permissible
    if((IQValue - IQValue_array[ brakeAndThrottleIndex_minus_1 ]) * 1000 / BRAKE_AND_THROTTLE_ADC_SAMPLING_PERIOD >= IQ_max * BRAKE_AND_THROTTLE_IQ_FACTOR)
    {
        IQValue = IQValue_array[ brakeAndThrottleIndex_minus_1 ] + (IQ_max * BRAKE_AND_THROTTLE_IQ_FACTOR) * BRAKE_AND_THROTTLE_ADC_SAMPLING_PERIOD / 1000;
    }
    IQValue_array[ brakeAndThrottleIndex ] = IQValue;
    // Calculate weighted moving average of IQ values
    uint16_t    IQValueTotal = 0;
    for (uint8_t index = 0; index < BRAKE_AND_THROTTLE_SAMPLES; index++)
    {
        uint8_t weightfactor;
        if (index == brakeAndThrottleIndex)
        {
            weightfactor = 2;
        }
        else
        {
            weightfactor = 1;
        }
        IQValueTotal += weightfactor * IQValue_array[index];
    }
    // ***** Calculate weighted moving average values
    IQValue = IQValueTotal / (BRAKE_AND_THROTTLE_SAMPLES + 1);
    IQValue_array[ brakeAndThrottleIndex ] = IQValue;
    /********************************************************************************************************************************
     * Send the throttle signal to STM32 Motor Controller
     ********************************************************************************************************************************/
    // in "brakeAndThrottle_CB(allowableSpeed, IQValue, brakeAndThrottle_errorMsg)", brakeAndThrottle_errorMsg is sent to the motor control unit for error handling if necessary.
    // Add one more conditions in order to fed the power into the motor controller
    // if DRIVE_START == 1 -> then run the command for dynamic Iq, otherwise: ignore it!
#ifdef CC2640R2_GENEV_5X5_ID
    brakeAndThrottle_CBs -> brakeAndThrottle_CB(allowableSpeed, IQValue, brakeAndThrottle_errorMsg);
#endif

    /********************************************************************************************************************************
     *      The following is a safety critical routine/condition
     *      Firmware only allows speed mode change when throttle is not pressed concurrently/fully released
     *      If speed mode is changed && throttle is not pressed or is released,
     *      firmware will then send instructions to STM32 and assigns speed mode parameters
     ********************************************************************************************************************************/
//    if ((speedModeChgFlag == 1) && (adc2Result <= THROTTLE_ADC_CALIBRATE_L))
//    {
////        motorcontrol_speedModeChgCB(speedModeIQmax, allowableSpeed, rampRate);
//        speedModeChgFlag = 0;
//        speedModeChgCheck++;
//    }

    //Sends brake signal to the controller for tail light toggling
    //Do it as you like !!!

    //Send brake percentage for Regen Brake....
    //Do it as you like
    if (gapRoleChanged == 1)
    {
        motorcontrol_setGatt(DASHBOARD_SERV_UUID, DASHBOARD_SPEED_MODE, DASHBOARD_SPEED_MODE_LEN, (uint8_t *) &speedMode);  //update speed mode on client (App)
        lightControl_gapRoleChg();
        gapRoleChanged = 0;
    }

    IQValue_array[ brakeAndThrottleIndex ] = IQValue;
    // ***** Increments brakeAndThrottleIndex by 1
    brakeAndThrottleIndex = brakeAndThrottleIndex++;
    if (brakeAndThrottleIndex >= BRAKE_AND_THROTTLE_SAMPLES)
    {
        brakeAndThrottleIndex = 0;
    }

}

/*********************************************************************
 * @fun    brakeAndThrottle_normalLawControl
 *
 * @brief   Normal Law Algorithm
 *
 * @param   Nil
 *
 * @return  Nil
 *********************************************************************/
static void brakeAndThrottle_normalLawControl()
{
    if (brakeAndThrottleIndex == 1)
    {
        brakeAndThrottleIndex_minus_1 = 0;
        brakeAndThrottleIndex_minus_2 = BRAKE_AND_THROTTLE_SAMPLES - 1;
    }
    else if (brakeAndThrottleIndex == 0)
    {
        brakeAndThrottleIndex_minus_1 = BRAKE_AND_THROTTLE_SAMPLES - 1;
        brakeAndThrottleIndex_minus_2 = BRAKE_AND_THROTTLE_SAMPLES - 2;
    }
    else
    {
        brakeAndThrottleIndex_minus_1 = brakeAndThrottleIndex - 1;
        brakeAndThrottleIndex_minus_2 = brakeAndThrottleIndex - 2;
    }

    RPM_array[ brakeAndThrottleIndex_minus_1 ] = RPM_temp;

    if ( IQValue > 0 )
    {
        uint16_t IQValue_temp = 0;

        if ( RPM_temp > allowableSpeed ) // if speed greater than or equal to allowable speed
        {
            IQValue_temp = IQValue_array[ brakeAndThrottleIndex_minus_1 ] * allowableSpeed * BRAKE_AND_THROTTLE_SPEED_FACTOR / RPM_temp ; //when speed is greater than speed limit, IQ is
            // reduced proportionally until speed is below the speed limit
        }
        else if ( RPM_temp < BRAKE_AND_THROTTLE_MINSPEED ) // this else-if routine is redundant -> it was checked previously
        {
            IQValue_temp = 0;
        }
        else    // if and when minSpeed <= RPM <= allowableSpeed
        {
            if ((IQValue_array[ brakeAndThrottleIndex ] - IQValue_array[ brakeAndThrottleIndex_minus_1 ]) >= 0)
            {
                double alpha = 1 - (float) (RPM_temp - BRAKE_AND_THROTTLE_MINSPEED) / (allowableSpeed - BRAKE_AND_THROTTLE_MINSPEED);
                double ff = pow(alpha, BRAKE_AND_THROTTLE_QQ);
                uint16_t delta_IQValue = (float) ff * ( IQValue_array[ brakeAndThrottleIndex ] - IQValue_array[ brakeAndThrottleIndex_minus_1 ] );
                IQValue_temp = IQValue_array[ brakeAndThrottleIndex_minus_1 ] + delta_IQValue;
            }
        }

        if ( IQValue > IQValue_temp )
        {
            IQValue = IQValue_temp;
        }
    }
#ifdef CC2640R2_LAUNVHXL
    UDHAL_TIM6_changeReadStatus(0);
#endif
}

/******************************************************
 *
 ******************************************************/
void brakeAndThrottle_gapRoleChg(uint8_t flag)
{
    gapRoleChanged = flag;
}

/*********************************************************************
 * @fn      brakeAndThrottle_getControlLaw
 *
 * @brief   call this function to retrieve the current control law
 *
 * @param   None
 *
 * @return  ControlLaw
 *********************************************************************/
extern uint8_t brakeAndThrottle_getControlLaw(){
    return ControlLaw;
}
/*********************************************************************
 * @fn      brakeAndThrottle_setControlLaw
 *
 * @brief   call this function to set Control Law
 *
 * @param   UnitSelectDash
 *
 * @return  none
 *********************************************************************/
extern void brakeAndThrottle_setControlLaw(uint8_t newControlLaw)
{
    ControlLaw = newControlLaw;
}
